# Модуль (англ. Module) - специальное средство языка
# программирования, позволяющее объединить вместе данные
# и функции и использовать их как одну функционально-законченную единицу
# Модуль - отдельный файл с кодом на Python, содержащий функции и данные:
# имеет расширение *.py (имя файла является именем модуля);
# может быть импортирован (подключен) (директива import ...);
# может быть многократно использован
# Список установленных встроенных модулей можно посмотреть следующим образом:
import sys
