# Пространства имён — это механизм, который позволяет разделять имена переменных,
# функций и других объектов в коде. Они представляют собой словарь, в котором ключами
# являются имена объектов, а значениями — сами объекты.
#
# В Python существует несколько видов пространств имён:
#
# Глобальное пространство имён — пространство имён, доступное на уровне модуля.
# Все объекты, созданные на уровне модуля, находятся в глобальном пространстве имён.
# Локальное пространство имён — пространство имён, создаваемое внутри функции или метода.
# Все объекты, созданные внутри функции, находятся в локальном пространстве имён.
# Встроенное пространство имён — пространство имён, содержащее встроенные функции и классы Python
# (например, print, int, list и т.д.).